read_verilog -sv shifter.v
hierarchy -check -top Shifter
prep -top Shifter
write_json blinky_plot.json
